sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.h
/*!
    \file    gd32a7xx_sent.h
    \brief   definitions for the SENT

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_SENT_H
#define GD32A7XX_SENT_H

#include "gd32a7xx.h"

/* SENT definitions */
#define SENT                          SENT_BASE

/* registers definitions */
#define SENT_CS                       REG32(SENT+ 0x00000000U)                             /*!< SENT control and status register */
#define SENT_FDIV                     REG32(SENT+ 0x00000004U)                             /*!< SENT fractional divider register */
#define SENT_GINTF                    REG32(SENT+ 0x00000008U)                             /*!< SENT global interrupt flag register */
#define SENT_TS                       REG32(SENT+ 0x0000000CU)                             /*!< SENT time stamp register */
#define SENT_TSPSC                    REG32(SENT+ 0x00000010U)                             /*!< SENT time stamp prescaler register */

#define SENT_CHRDATA(channel)         REG32(((SENT) + 0x100U) + 0x100U * (channel))        /*!< channel x receive data register */
#define SENT_CHPSC(channel)           REG32(((SENT) + 0x104U) + 0x100U * (channel))        /*!< channel x prescaler register */
#define SENT_CHFDIV(channel)          REG32(((SENT) + 0x108U) + 0x100U * (channel))        /*!< channel x fractional divider register */
#define SENT_CHRCTL(channel)          REG32(((SENT) + 0x10CU) + 0x100U * (channel))        /*!< channel x receive control register */
#define SENT_CHRSTAT(channel)         REG32(((SENT) + 0x110U) + 0x100U * (channel))        /*!< channel x receive status register */
#define SENT_CHRSDSTAT(channel)       REG32(((SENT) + 0x114U) + 0x100U * (channel))        /*!< channel x receive serial data and status register */
#define SENT_CHCS(channel)            REG32(((SENT) + 0x118U) + 0x100U * (channel))        /*!< channel x control and status register */
#define SENT_CHSTAT(channel)          REG32(((SENT) + 0x11CU) + 0x100U * (channel))        /*!< channel x status register */
#define SENT_CHSTATCTL(channel)       REG32(((SENT) + 0x120U) + 0x100U * (channel))        /*!< channel x status control register */
#define SENT_CHSTATC(channel)         REG32(((SENT) + 0x124U) + 0x100U * (channel))        /*!< channel x status clear register */
#define SENT_CHINTEN(channel)         REG32(((SENT) + 0x128U) + 0x100U * (channel))        /*!< channel x interrupt enable register */
#define SENT_CHWDGT(channel)          REG32(((SENT) + 0x12CU) + 0x100U * (channel))        /*!< channel x watchdog timer register */
#define SENT_CHTS(channel)            REG32(((SENT) + 0x130U) + 0x100U * (channel))        /*!< channel x receive time stamp register */
#define SENT_CHRDPCFG(channel)        REG32(((SENT) + 0x134U) + 0x100U * (channel))        /*!< channel x receive data position configuration register */

/* bits definitions */
/* SENT_CS */
#define SENT_CS_SENTEN                BIT(0)                              /*!< enable SENT receiver */
#define SENT_CS_SENTF                 BIT(1)                              /*!< SENT status */
#define SENT_CS_SLPEN                 BIT(3)                              /*!< enable SENT sleep mode */

/* SENT_FDIV */
#define SENT_FDIV_STEP                BITS(0,9)                           /*!< step value */
#define SENT_FDIV_DIVMOD              BITS(14,15)                         /*!< fractional divider mode */
#define SENT_FDIV_RVAL                BITS(16,25)                         /*!< result value */

/* SENT_GINTF */
#define SENT_GINTF_CH0GIF             BIT(0)                              /*!< global interrupt flag of channel 0 */
#define SENT_GINTF_CH1GIF             BIT(1)                              /*!< global interrupt flag of channel 1 */
#define SENT_GINTF_CH2GIF             BIT(2)                              /*!< global interrupt flag of channel 2 */
#define SENT_GINTF_CH3GIF             BIT(3)                              /*!< global interrupt flag of channel 3 */
#define SENT_GINTF_CH4GIF             BIT(4)                              /*!< global interrupt flag of channel 4 */
#define SENT_GINTF_CH5GIF             BIT(5)                              /*!< global interrupt flag of channel 5 */

/* SENT_TS */
#define SENT_TS_TS                    BITS(0,31)                          /*!< time stamp */

/* SENT_TSPSC */
#define SENT_TSPSC_TSPSC              BITS(0,19)                          /*!< dividing factor for the time stamp prescaler */

/* SENT_CHxRDATA */
#define SENT_CHXRDATA_DNIB0           BITS(0,3)                           /*!< channel x receive data nibble 0 */
#define SENT_CHXRDATA_DNIB1           BITS(4,7)                           /*!< channel x receive data nibble 1 */
#define SENT_CHXRDATA_DNIB2           BITS(8,11)                          /*!< channel x receive data nibble 2 */
#define SENT_CHXRDATA_DNIB3           BITS(12,15)                         /*!< channel x receive data nibble 3 */
#define SENT_CHXRDATA_DNIB4           BITS(16,19)                         /*!< channel x receive data nibble 4 */
#define SENT_CHXRDATA_DNIB5           BITS(20,23)                         /*!< channel x receive data nibble 5 */
#define SENT_CHXRDATA_DNIB6           BITS(24,27)                         /*!< channel x receive data nibble 6 */
#define SENT_CHXRDATA_DNIB7           BITS(28,31)                         /*!< channel x receive data nibble 7 */

/* SENT_CHxPSC */
#define SENT_CHXPSC_PSC               BITS(0,11)                          /*!< channel x prescaler factor */

/* SENT_CHxFDIV */
#define SENT_CHXFDIV_DIV              BITS(0,15)                          /*!< channel x fractional divider factor */
#define SENT_CHXFDIV_MDIV             BITS(15,31)                         /*!< channel x measured fractional divider factor */

