sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.h
/* SENT_CHxRCTL */
#define SENT_CHXRCTL_CHEN             BIT(0)                              /*!< channel enable */
#define SENT_CHXRCTL_IPP              BIT(1)                              /*!< ignore pause pulse */
#define SENT_CHXRCTL_ALTCRCMEN        BIT(2)                              /*!< alternative CRC mode enable */
#define SENT_CHXRCTL_CRCSNIB          BIT(3)                              /*!< whether status and communication nibble is included in CRC calculation of fast channel (signal) data */
#define SENT_CHXRCTL_SDHWPEN          BIT(4)                              /*!< serial data hardware parse enable */
#define SENT_CHXRCTL_SDCRCEN          BIT(5)                              /*!< serial data CRC enable */
#define SENT_CHXRCTL_CRCEN            BIT(6)                              /*!< CRC enable */
#define SENT_CHXRCTL_CSYNCM           BIT(7)                              /*!< consecutive synchronization check mode */
#define SENT_CHXRCTL_DLEN             BITS(12,15)                         /*!< data length */
#define SENT_CHXRCTL_SMCRCM           BIT(16)                             /*!< serial message CRC mode */
#define SENT_CHXRCTL_SMM              BIT(17)                             /*!< serial message mode */
#define SENT_CHXRCTL_FDERRMEN         BIT(18)                             /*!< frequency drift error mode enable */
#define SENT_CHXRCTL_FDCEN            BIT(20)                             /*!< frequency drift check enable */

/* SENT_CHxRSTAT */
#define SENT_CHXRSTAT_CRC             BITS(0,3)                           /*!< CRC nibble */
#define SENT_CHXRSTAT_CHSTAT          BITS(4,5)                           /*!< channel status */
#define SENT_CHXRSTAT_STACOM          BITS(8,11)                          /*!< status and communication nibble */
#define SENT_CHXRSTAT_FCNT            BITS(16,31)                         /*!< counter of a frame, including pause pulse */

/* SENT_CHxRSDSTAT */
#define SENT_CHXRSDSTAT_SDATA         BITS(0,15)                          /*!< serial data */
#define SENT_CHXRSDSTAT_MSGID         BITS(16,23)                         /*!< message ID */
#define SENT_CHXRSDSTAT_SDCRC         BITS(24,29)                         /*!< serial data CRC value */
#define SENT_CHXRSDSTAT_ESDT          BIT(31)                             /*!< enhanced serial data message type */

/* SENT_CHxCS */
#define SENT_CHXCS_INSEL              BITS(0,1)                           /*!< select input x */
#define SENT_CHXCS_DFTTH              BITS(4,7)                           /*!< digital filter timer threshold */
#define SENT_CHXCS_PPL                BIT(9)                              /*!< pulse polarity */
#define SENT_CHXCS_EGCNTC             BIT(10)                             /*!< edge counter clear */
#define SENT_CHXCS_REGNDF             BIT(12)                             /*!< rising edge noise detect flag */
#define SENT_CHXCS_FEGNDF             BIT(13)                             /*!< falling edge noise detect flag */
#define SENT_CHXCS_REGNDFC            BIT(14)                             /*!< rising edge noise detect flag clear */
#define SENT_CHXCS_FEGNDFC            BIT(15)                             /*!< falling edge noise detect flag clear */
#define SENT_CHXCS_EGCNT              BITS(20,27)                         /*!< edge counter */
#define SENT_CHXCS_RSL                BIT(30)                             /*!< receive signal level */

/* SENT_CHxSTAT */
#define SENT_CHXSTAT_RSF              BIT(0)                              /*!< receive success flag */
#define SENT_CHXSTAT_RBNE             BIT(1)                              /*!< receive buffer not empty flag */
#define SENT_CHXSTAT_RXOVERR          BIT(2)                              /*!< receive buffer overflow error flag */
#define SENT_CHXSTAT_FDEVERR          BIT(5)                              /*!< frequency deviation error flag */
#define SENT_CHXSTAT_FDERR            BIT(6)                              /*!< frequency drift error flag */
#define SENT_CHXSTAT_NNIBERR          BIT(7)                              /*!< number of nibbles error flag */
#define SENT_CHXSTAT_NIBVERR          BIT(8)                              /*!< nibble value error flag */
#define SENT_CHXSTAT_CRCERR           BIT(9)                              /*!< CRC error flag */
#define SENT_CHXSTAT_SSDSTERR         BIT(10)                             /*!< short serial data message start bit error flag */
#define SENT_CHXSTAT_SDRBNE           BIT(11)                             /*!< serial data receive buffer not empty flag */
#define SENT_CHXSTAT_SDCRCERR         BIT(12)                             /*!< serial data CRC error flag */
#define SENT_CHXSTAT_WDERR            BIT(13)                             /*!< watchdog error flag */

/* SENT_CHxSTATCTL */
#define SENT_CHxSTATCTL_RSFS          BIT(0)                              /*!< receive success flag set */
#define SENT_CHxSTATCTL_RBNES         BIT(1)                              /*!< receive buffer not empty flag set */
#define SENT_CHxSTATCTL_RXOVERRS      BIT(2)                              /*!< receive buffer overflow error flag set */
#define SENT_CHxSTATCTL_FDEVERRS      BIT(5)                              /*!< frequency deviation error flag set */
#define SENT_CHxSTATCTL_FDERRS        BIT(6)                              /*!< frequency drift error flag set */
#define SENT_CHxSTATCTL_NNIBERRS      BIT(7)                              /*!< number of nibbles error flag set */
#define SENT_CHxSTATCTL_NIBVERRS      BIT(8)                              /*!< nibble value error flag set */
#define SENT_CHxSTATCTL_CRCERRS       BIT(9)                              /*!< CRC error flag set */
#define SENT_CHxSTATCTL_SSDSTERRS     BIT(10)                             /*!< short serial data message start bit error flag set */
#define SENT_CHxSTATCTL_SDRBNES       BIT(11)                             /*!< serial data receive buffer not empty flag set */
#define SENT_CHxSTATCTL_SDCRCERRS     BIT(12)                             /*!< serial data CRC error flag set */
#define SENT_CHxSTATCTL_WDERRS        BIT(13)                             /*!< watchdog error flag set */

/* SENT_CHxSTATC */
#define SENT_CHXSTATC_RSFC            BIT(0)                              /*!< receive success flag clear */
#define SENT_CHXSTATC_RBNEC           BIT(1)                              /*!< receive buffer not empty flag clear */
#define SENT_CHXSTATC_RXOVERRC        BIT(2)                              /*!< receive buffer overflow error flag clear */
#define SENT_CHXSTATC_FDEVERRC        BIT(5)                              /*!< frequency deviation error flag clear */
#define SENT_CHXSTATC_FDERRC          BIT(6)                              /*!< frequency drift error flag clear */
#define SENT_CHXSTATC_NNIBERRC        BIT(7)                              /*!< number of nibbles error flag clear */
#define SENT_CHXSTATC_NIBVERRC        BIT(8)                              /*!< nibble value error flag clear */
#define SENT_CHXSTATC_CRCERRC         BIT(9)                              /*!< CRC error flag clear */
#define SENT_CHXSTATC_SSDSTERRC       BIT(10)                             /*!< short serial data message start bit error flag clear */
#define SENT_CHXSTATC_SDRBNEC         BIT(11)                             /*!< serial data receive buffer not empty flag clear */
#define SENT_CHXSTATC_SDCRCERRC       BIT(12)                             /*!< serial data CRC error flag clear */
#define SENT_CHXSTATC_WDERRC          BIT(13)                             /*!< watchdog error flag clear */

/* SENT_CHxINTEN */
#define SENT_CHXINTEN_RSFIE           BIT(0)                              /*!< receive success interrupt enable */
#define SENT_CHXINTEN_RBNEIE          BIT(1)                              /*!< receive buffer not empty interrupt enable */
#define SENT_CHXINTEN_RXOVERRIE       BIT(2)                              /*!< receive buffer overflow error interrupt enable */
#define SENT_CHXINTEN_FDEVERRIE       BIT(5)                              /*!< frequency deviation error interrupt enable */
#define SENT_CHXINTEN_FDERRIE         BIT(6)                              /*!< frequency drift error interrupt enable */
#define SENT_CHXINTEN_NNIBERRIE       BIT(7)                              /*!< number of nibbles error interrupt enable */
#define SENT_CHXINTEN_NIBVERRIE       BIT(8)                              /*!< nibble value error interrupt enable */
#define SENT_CHXINTEN_CRCERRIE        BIT(9)                              /*!< CRC error interrupt enable */
#define SENT_CHXINTEN_SSDSTERRIE      BIT(10)                             /*!< short serial data message start bit error interrupt enable */
#define SENT_CHXINTEN_SDRBNEIE        BIT(11)                             /*!< serial data receive buffer not empty interrupt enable */
#define SENT_CHXINTEN_SDCRCERRIE      BIT(12)                             /*!< serial data CRC error interrupt enable */
#define SENT_CHXINTEN_WDERRIE         BIT(13)                             /*!< watchdog error interrupt enable */

/* SENT_CHxWDGT */
#define SENT_CHXWDGT_THOLD            BITS(0,15)                          /*!< watchdog timer counter threshold value for channel x */

/* SENT_CHxTS */
#define SENT_CHXTS_TS                 BITS(0,31)                          /*!< channel x time stamp */

