sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.h
/* SENT_CHxRDPCFG */
#define SENT_CHXRDPCFG_DNIB0P         BITS(0,2)                           /*!< channel x receive data nibble 0 position */
#define SENT_CHXRDPCFG_DNIB1P         BITS(4,6)                           /*!< channel x receive data nibble 1 position */
#define SENT_CHXRDPCFG_DNIB2P         BITS(8,10)                          /*!< channel x receive data nibble 2 position */
#define SENT_CHXRDPCFG_DNIB3P         BITS(12,14)                         /*!< channel x receive data nibble 3 position */
#define SENT_CHXRDPCFG_DNIB4P         BITS(16,18)                         /*!< channel x receive data nibble 4 position */
#define SENT_CHXRDPCFG_DNIB5P         BITS(20,22)                         /*!< channel x receive data nibble 5 position */
#define SENT_CHXRDPCFG_DNIB6P         BITS(24,26)                         /*!< channel x receive data nibble 6 position */
#define SENT_CHXRDPCFG_DNIB7P         BITS(28,30)                         /*!< channel x receive data nibble 7 position */

/* constants definitions */
/* SENT parameter structure */
typedef struct {
    uint32_t freq_drift_check;                                            /*!< specifies the frequency drift check based on frame length is enable or disable */
    uint32_t freq_drift_error_mode;                                       /*!< specifies the frequency drift error mode is enable or disable */
    uint32_t serial_message_mode;                                         /*!< specifies the serial message mode */
    uint32_t serial_message_crc_mode;                                     /*!< specifies the CRC calculation method for serial message */
    uint32_t data_length;                                                 /*!< specifies the data nibble count of a frame */
    uint32_t cons_sync_check_mode;                                        /*!< specifies the consecutive synchronization check mode */
    uint32_t crc;                                                         /*!< specifies the CRC function is enable or disable */
    uint32_t serial_data_crc;                                             /*!< specifies the serial data CRC function is enable or disable */
    uint32_t serial_data_parse;                                           /*!< specifies the serial data hardware parse is enable or disable */
    uint32_t status_nibble_in_crc;                                        /*!< specifies whether status and communication nibble is included in CRC calculation of fast channel (signal) data */
    uint32_t alter_crc_mode;                                              /*!< specifies the alternative 4-bit parallel CRC calculation is enable or disable*/
    uint32_t ignore_pause;                                                /*!< specifies the pause pulse is ignored or not during synchronization */
    uint32_t pulse_polarity;                                              /*!< specifies the pulse polarity is active low or high */
} sent_parameter_struct;

/* SENT frame structure */
typedef struct
{
    uint32_t data;                                                        /*!< the data from last received frame */
    uint32_t timestamp;                                                   /*!< the timestamp of last received frame */
    uint8_t  statusnibble;                                                /*!< the status and communication nibble of last received frame */
    uint8_t  crcnibble;                                                   /*!< the crc nibble of last received frame */
} sent_frame_struct;

/* SENT serial message frame structure */
typedef struct
{
    uint8_t                             crc;                              /*!< the received CRC value */
    uint8_t                             messageid;                        /*!< the received message ID value */
    uint16_t                            serialdata;                       /*!< received serial data value */
    uint8_t                             configbit;                        /*!< the received configuration bit value */
} sent_serialmessage_frame_struct;

/* SENT nibble position enumeration */
typedef enum
{
    SENT_NIBBLE_0 = 0U,                                                   /*!< specifies receive data target nibble pointer to nibble 0  */
    SENT_NIBBLE_1,                                                        /*!< specifies receive data target nibble pointer to nibble 1  */
    SENT_NIBBLE_2,                                                        /*!< specifies receive data target nibble pointer to nibble 2  */
    SENT_NIBBLE_3,                                                        /*!< specifies receive data target nibble pointer to nibble 3  */
    SENT_NIBBLE_4,                                                        /*!< specifies receive data target nibble pointer to nibble 4  */
    SENT_NIBBLE_5,                                                        /*!< specifies receive data target nibble pointer to nibble 5  */
    SENT_NIBBLE_6,                                                        /*!< specifies receive data target nibble pointer to nibble 6  */
    SENT_NIBBLE_7                                                         /*!< specifies receive data target nibble pointer to nibble 7  */
} sent_nibble_position_enum;

/* SENT nibble control structure */
typedef struct
{
    sent_nibble_position_enum           nibble0_position;                 /*!< specifies the received nibble0 control */
    sent_nibble_position_enum           nibble1_position;                 /*!< specifies the received nibble1 control */
    sent_nibble_position_enum           nibble2_position;                 /*!< specifies the received nibble2 control */
    sent_nibble_position_enum           nibble3_position;                 /*!< specifies the received nibble3 control */
    sent_nibble_position_enum           nibble4_position;                 /*!< specifies the received nibble4 control */
    sent_nibble_position_enum           nibble5_position;                 /*!< specifies the received nibble5 control */
    sent_nibble_position_enum           nibble6_position;                 /*!< specifies the received nibble6 control */
    sent_nibble_position_enum           nibble7_position;                 /*!< specifies the received nibble7 control */
} sent_nibble_control_struct;

/* SENT channel select enumeration */
typedef enum 
{
    SENT_CH0 = 0U,                                                        /*!< SENT channel 0 */
    SENT_CH1,                                                             /*!< SENT channel 1 */
    SENT_CH2,                                                             /*!< SENT channel 2 */
    SENT_CH3,                                                             /*!< SENT channel 3 */
    SENT_CH4,                                                             /*!< SENT channel 4 */
    SENT_CH5                                                              /*!< SENT channel 5 */
} sent_channel_enum;  

/* SENT channel input select enumeration */
typedef enum 
{
    SENT_ALTI_INPUT0 = 0U,                                                /*!< SENT input select 0 */
    SENT_ALTI_INPUT1,                                                     /*!< SENT input select 1 */
    SENT_ALTI_INPUT2,                                                     /*!< SENT input select 2 */
    SENT_ALTI_INPUT3                                                      /*!< SENT input select 3 */
} sent_channel_input_enum;

/* define the SENT bit position and its register index offset */
#define SENT_REGIDX_BIT(regidx, bitpos)  (((uint32_t)((regidx) << 6U)) | (uint32_t)(bitpos))
#define SENT_REG_VAL(offset, channelx)   (REG32(SENT + ((0x00000100U * (uint32_t)((channelx) + 0x00000001U)) + ((uint32_t)(((offset) & 0x0000FFFFU) >> 6U)))))
#define SENT_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)

/* register offset */
#define SENT_CHSTAT_REG_OFFSET           ((uint32_t)(0x0000001CU))                       /*!< CHSTAT register offset */
#define SENT_CHCS_REG_OFFSET             ((uint32_t)(0x00000018U))                       /*!< CHCS register offset */
#define SENT_CHSTATC_REG_OFFSET          ((uint32_t)(0x00000024U))                       /*!< STATCTL register offset */

/* SENT flags */
typedef enum {
    /* flags in CHSTAT register */
    SENT_FLAG_RSF                = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 0U),          /*!< receive success flag */
    SENT_FLAG_RBNE               = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 1U),          /*!< receive buffer not empty flag */
    SENT_FLAG_RXOVERR            = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 2U),          /*!< receive buffer overflow error flag */
    SENT_FLAG_FDEVERR            = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 5U),          /*!< frequency deviation error flag */
    SENT_FLAG_FDERR              = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 6U),          /*!< frequency drift error flag */
    SENT_FLAG_NNIBERR            = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 7U),          /*!< number of nibbles error flag */
    SENT_FLAG_NIBVERR            = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 8U),          /*!< nibble value error flag */
    SENT_FLAG_CRCERR             = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 9U),          /*!< CRC error flag */
    SENT_FLAG_SSDSTERR           = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 10U),         /*!< short serial data message start bit error flag */
    SENT_FLAG_SDRBNE             = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 11U),         /*!< serial data receive buffer not empty flag */
    SENT_FLAG_SDCRCERR           = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 12U),         /*!< serial data CRC error flag */
    SENT_FLAG_WDERR              = SENT_REGIDX_BIT(SENT_CHSTAT_REG_OFFSET, 13U),         /*!< watchdog error flag */
    /* flags in CHCS register */
    SENT_FLAG_REGNDF             = SENT_REGIDX_BIT(SENT_CHCS_REG_OFFSET, 12U),           /*!< rising edge noise detect flag */
    SENT_FLAG_FEGNDF             = SENT_REGIDX_BIT(SENT_CHCS_REG_OFFSET, 13U),           /*!< falling edge noise detect flag */
    SENT_FLAG_RSL                = SENT_REGIDX_BIT(SENT_CHCS_REG_OFFSET, 30U)            /*!< receive signal level */
} sent_channel_flag_enum;

/* SENT flags clear */
typedef enum {
    /* flags clear in CHSTAT register */
    SENT_FLAG_RSFC               = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 0U),       /*!< receive success flag clear */
    SENT_FLAG_RBNEC              = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 1U),       /*!< receive buffer not empty flag clear */
    SENT_FLAG_RXOVERRC           = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 2U),       /*!< receive buffer overflow error flag clear */
    SENT_FLAG_FDEVERRC           = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 5U),       /*!< frequency deviation error flag clear */
    SENT_FLAG_FDERRC             = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 6U),       /*!< frequency drift error flag clear */
    SENT_FLAG_NNIBERRC           = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 7U),       /*!< number of nibbles error flag clear */
    SENT_FLAG_NIBVERRC           = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 8U),       /*!< nibble value error flag clear */
    SENT_FLAG_CRCERRC            = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 9U),       /*!< CRC error flag clear */
    SENT_FLAG_SSDSTERRC          = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 10U),      /*!< short serial data message start bit error flag clear */
    SENT_FLAG_SDRBNEC            = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 11U),      /*!< serial data receive buffer not empty flag flag clear */
    SENT_FLAG_SDCRCERRC          = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 12U),      /*!< serial data CRC error flag clear */
    SENT_FLAG_WDERRC             = SENT_REGIDX_BIT(SENT_CHSTATC_REG_OFFSET, 13U),      /*!< watchdog error flag clear */
    /* flags clear in CHCS register */
    SENT_FLAG_REGNDFC            = SENT_REGIDX_BIT(SENT_CHCS_REG_OFFSET, 14U),           /*!< rising edge noise detect flag clear */
    SENT_FLAG_FEGNDFC            = SENT_REGIDX_BIT(SENT_CHCS_REG_OFFSET, 15U)            /*!< falling edge noise detect flag clear */
} sent_channel_flag_clear_enum;

/* frequency drift check */
#define SENT_FREQ_DRIFT_CHECK_ENABLE                    SENT_CHXRCTL_FDCEN           /*!< frequency drift check based on frame length is enable */
#define SENT_FREQ_DRIFT_CHECK_DISABLE                   ((uint32_t)0x00000000U)      /*!< frequency drift check based on frame length is disaable */

/* frequency drift error mode */
#define SENT_FREQ_DRIFT_ERROR_ENABLE                    SENT_CHXRCTL_FDERRMEN        /*!< frequency drift error mode is enable */
#define SENT_FREQ_DRIFT_ERROR_DISABLE                   ((uint32_t)0x00000000U)      /*!< frequency drift error mode is disable */

/* serial message mode */
#define SENT_ENHANCED_SERIAL_MESSAGE                    SENT_CHXRCTL_SMM             /*!< enhanced serial message */
#define SENT_SHORT_SERIAL_MESSAGE                       ((uint32_t)0x00000000U)      /*!< short serial message */

/* serial message CRC mode */
#define SENT_SERIAL_MESSAGE_AUGMENTATION_CRC            SENT_CHXRCTL_SMCRCM          /*!< CRC mode is augmentation mode */
#define SENT_SERIAL_MESSAGE_NORMAL_CRC                  ((uint32_t)0x00000000U)      /*!< CRC mode is normal mode */

