sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.h
/* data length */
#define CHXRCTL_DATALEN(regval)                         (BITS(12,15) & ((uint32_t)(regval) << 12U))
#define SENT_DATALEN_0_NIBBLE                           CHXRCTL_DATALEN(0)           /*!< 0 data nibble */
#define SENT_DATALEN_1_NIBBLE                           CHXRCTL_DATALEN(1)           /*!< 1 data nibble */
#define SENT_DATALEN_2_NIBBLE                           CHXRCTL_DATALEN(2)           /*!< 2 data nibble */
#define SENT_DATALEN_3_NIBBLE                           CHXRCTL_DATALEN(3)           /*!< 3 data nibble */
#define SENT_DATALEN_4_NIBBLE                           CHXRCTL_DATALEN(4)           /*!< 4 data nibble */
#define SENT_DATALEN_5_NIBBLE                           CHXRCTL_DATALEN(5)           /*!< 5 data nibble */
#define SENT_DATALEN_6_NIBBLE                           CHXRCTL_DATALEN(6)           /*!< 6 data nibble */
#define SENT_DATALEN_7_NIBBLE                           CHXRCTL_DATALEN(7)           /*!< 7 data nibble */
#define SENT_DATALEN_8_NIBBLE                           CHXRCTL_DATALEN(8)           /*!< 8 data nibble */

/* consecutive synchronization check mode */
#define SENT_CONS_SYNC_CHECK_AFTER                      SENT_CHXRCTL_CSYNCM          /*!< check the synchronization/calibration pulse deviation between the current frame and the next frame */
#define SENT_CONS_SYNC_CHECK_BEFORE                     ((uint32_t)0x00000000U)      /*!< check the synchronization/calibration pulse deviation between the current frame and the previous frame */

/* CRC enable */
#define SENT_CRC_ENABLE                                 SENT_CHXRCTL_CRCEN           /*!< enable CRC function */
#define SENT_CRC_DISABLE                                ((uint32_t)0x00000000U)      /*!< disable CRC function */

/* serial data CRC enable */
#define SENT_SERIAL_DATA_CRC_ENABLE                     SENT_CHXRCTL_SDCRCEN         /*!< enable serial data CRC function */
#define SENT_SERIAL_DATA_CRC_DISABLE                    ((uint32_t)0x00000000U)      /*!< disable serial data CRC function */

/* serial data parse mode */
#define SENT_SERIAL_DATA_HARDWARE_PARSE                 SENT_CHXRCTL_SDHWPEN         /*!< serial data hardware parse mode */
#define SENT_SERIAL_DATA_SOFTWARE_PARSE                 ((uint32_t)0x00000000U)      /*!< serial data software parse mode */

/* status and communication nibble is included in CRC calculation or not */
#define SENT_STATUS_NIBBLE_IN_CRC                       SENT_CHXRCTL_CRCSNIB         /*!< status and communication nibble is included in CRC calculation */
#define SENT_STATUS_NIBBLE_NOT_IN_CRC                   ((uint32_t)0x00000000U)      /*!< status and communication nibble is not included in CRC calculation*/

/* alternative CRC mode */
#define SENT_PARALLEL_CRC                               SENT_CHXRCTL_ALTCRCMEN       /*!< alternative 4-bit parallel CRC mode */
#define SENT_STANDARD_CRC                               ((uint32_t)0x00000000U)      /*!< standard CRC mode */

/* ignore pause pulse */
#define SENT_IGNORE_PAUSE                               SENT_CHXRCTL_IPP             /*!< ignore pause pulse */
#define SENT_NOT_IGNORE_PAUSE                           ((uint32_t)0x00000000U)      /*!< not ignore pause pulse */

/* pulse polarity */
#define SENT_PULSE_POLARITY_HIGH                        SENT_CHXCS_PPL               /*!< pulse polarity is active high */
#define SENT_PULSE_POLARITY_LOW                         ((uint32_t)0x00000000U)      /*!< pulse polarity is active low */

/* fractional divider mode */
#define SENT_CLOCKDIVIDERMODE_OFF                       ((uint32_t)0x00000000U)      /*!< disable fractional divider */
#define SENT_CLOCKDIVIDERMODE_NORMAL                    ((uint32_t)0x00000001U)      /*!< normal divider mode */
#define SENT_CLOCKDIVIDERMODE_FRACTIONAL                ((uint32_t)0x00000002U)      /*!< fractional divider mode*/

/* define the SENT channel status */
#define SENT_CH_STOP                                    ((uint32_t)(0x00000000U))    /*!< channel is disabled */
#define SENT_CH_INIT                                    ((uint32_t)(0x00000010U))    /*!< channel is enabled, but synchronization/calibration pulse  has not been received */
#define SENT_CH_RUN                                     ((uint32_t)(0x00000020U))    /*!< channel is enabled and the synchronization/calibration pulse received was out of the correct frequency range or had frequency drift and was out of range. */
#define SENT_CH_SYNC                                    ((uint32_t)(0x00000030U))    /*!< Channel is enabled and synchronization/calibration pulse received is valid and in the synchronization state */

#define SENT_INT_RSF                                    SENT_CHXINTEN_RSFIE          /*!< receive success interrupt enable */
#define SENT_INT_RBNE                                   SENT_CHXINTEN_RBNEIE         /*!< receive buffer not empty interrupt enable */
#define SENT_INT_RXOVERR                                SENT_CHXINTEN_RXOVERRIE      /*!< receive buffer overflow error interrupt enable */
#define SENT_INT_FDEVERR                                SENT_CHXINTEN_FDEVERRIE      /*!< frequency deviation error interrupt enable */
#define SENT_INT_FDERR                                  SENT_CHXINTEN_FDERRIE        /*!< frequency drift error interrupt enable */
#define SENT_INT_NNIBERR                                SENT_CHXINTEN_NNIBERRIE      /*!< number of nibbles error interrupt enable */
#define SENT_INT_NIBVERR                                SENT_CHXINTEN_NIBVERRIE      /*!< nibble value error interrupt enable */
#define SENT_INT_CRCERR                                 SENT_CHXINTEN_CRCERRIE       /*!< CRC error interrupt enable */
#define SENT_INT_SSDSTERR                               SENT_CHXINTEN_SSDSTERRIE     /*!< short serial data message start bit error interrupt enable */
#define SENT_INT_SDRBNE                                 SENT_CHXINTEN_SDRBNEIE       /*!< serial data receive buffer not empty interrupt enable */
#define SENT_INT_SDCRCERR                               SENT_CHXINTEN_SDCRCERRIE     /*!< serial data CRC error interrupt enable */
#define SENT_INT_WDERR                                  SENT_CHXINTEN_WDERRIE        /*!< watchdog error interrupt enable */

#define SENT_INT_FLAG_RSF                               SENT_CHXSTAT_RSF             /*!< receive success interrupt flag */
#define SENT_INT_FLAG_RBNE                              SENT_CHXSTAT_RBNE            /*!< receive buffer not empty interrupt flag */
#define SENT_INT_FLAG_RXOVERR                           SENT_CHXSTAT_RXOVERR         /*!< receive buffer overflow error interrupt flag */
#define SENT_INT_FLAG_FDEVERR                           SENT_CHXSTAT_FDEVERR         /*!< frequency deviation error interrupt flag */
#define SENT_INT_FLAG_FDERR                             SENT_CHXSTAT_FDERR           /*!< frequency drift error interrupt flag */
#define SENT_INT_FLAG_NNIBERR                           SENT_CHXSTAT_NNIBERR         /*!< number of nibbles error interrupt flag */
#define SENT_INT_FLAG_NIBVERR                           SENT_CHXSTAT_NIBVERR         /*!< nibble value error interrupt flag */
#define SENT_INT_FLAG_CRCERR                            SENT_CHXSTAT_CRCERR          /*!< CRC error interrupt flag */
#define SENT_INT_FLAG_SSDSTERR                          SENT_CHXSTAT_SSDSTERR        /*!< short serial data message start bit error interrupt flag */
#define SENT_INT_FLAG_SDRBNE                            SENT_CHXSTAT_SDRBNE          /*!< serial data receive buffer not empty flag interrupt flag */
#define SENT_INT_FLAG_SDCRCERR                          SENT_CHXSTAT_SDCRCERR        /*!< serial data CRC error interrupt flag */
#define SENT_INT_FLAG_WDERR                             SENT_CHXSTAT_WDERR           /*!< watchdog error interrupt flag */
   
