sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sent.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check frequency drift check parameter */
#define NOT_SENT_FREQ_DRIFT_CHECK(newvalue)             (((newvalue) != SENT_FREQ_DRIFT_CHECK_ENABLE) && ((newvalue) != SENT_FREQ_DRIFT_CHECK_DISABLE))

/* check frequency drift error mode parameter */
#define NOT_SENT_FREQ_DRIFT_ERROR(newvalue)             (((newvalue) != SENT_FREQ_DRIFT_ERROR_ENABLE) && ((newvalue) != SENT_FREQ_DRIFT_ERROR_DISABLE))

/* check serial message mode parameter */
#define NOT_SENT_SERIAL_MSG_MODE(mode)                  (((mode) != SENT_SHORT_SERIAL_MESSAGE) && ((mode) != SENT_ENHANCED_SERIAL_MESSAGE))

/* check serial message CRC mode parameter */
#define NOT_SENT_SERIAL_MSG_CRC_MODE(mode)              (((mode) != SENT_SERIAL_MESSAGE_AUGMENTATION_CRC) && ((mode) != SENT_SERIAL_MESSAGE_NORMAL_CRC))

/* check data length parameter */
#define NOT_SENT_DATA_LENGTH(length)                    (((length) != SENT_DATALEN_0_NIBBLE) && ((length) != SENT_DATALEN_1_NIBBLE) && ((length) != SENT_DATALEN_2_NIBBLE) && \
                                                        ((length) != SENT_DATALEN_3_NIBBLE) && ((length) != SENT_DATALEN_4_NIBBLE) && ((length) != SENT_DATALEN_5_NIBBLE) && \
                                                        ((length) != SENT_DATALEN_6_NIBBLE) && ((length) != SENT_DATALEN_7_NIBBLE) && ((length) != SENT_DATALEN_8_NIBBLE))

/* check consecutive synchronization check mode parameter */
#define NOT_SENT_CONS_SYNC_CHECK(mode)                  (((mode) != SENT_CONS_SYNC_CHECK_BEFORE) && ((mode) != SENT_CONS_SYNC_CHECK_AFTER))

/* check CRC enable parameter */
#define NOT_SENT_CRC(newvalue)                          (((newvalue) != SENT_CRC_ENABLE) && ((newvalue) != SENT_CRC_DISABLE))

/* check serial data CRC enable parameter */
#define NOT_SENT_SERIAL_DATA_CRC(newvalue)              (((newvalue) != SENT_SERIAL_DATA_CRC_ENABLE) && ((newvalue) != SENT_SERIAL_DATA_CRC_DISABLE))

/* check serial data parse mode parameter */
#define NOT_SENT_SERIAL_DATA_PARSE(mode)                (((mode) != SENT_SERIAL_DATA_HARDWARE_PARSE) && ((mode) != SENT_SERIAL_DATA_SOFTWARE_PARSE))

/* check status and communication nibble is included in CRC calculation or not parameter */
#define NOT_SENT_STATUS_NIBBLE_IN_CRC(mode)             (((mode) != SENT_STATUS_NIBBLE_IN_CRC) && ((mode) != SENT_STATUS_NIBBLE_NOT_IN_CRC))

/* check alternative CRC mode parameter */
#define NOT_SENT_ALTER_CRC(crc)                         (((crc) != SENT_PARALLEL_CRC) && ((crc) != SENT_STANDARD_CRC))

/* check ignore pause pulse or not parameter */
#define NOT_SENT_IGNORE_PAUSE(mode)                     (((mode) != SENT_IGNORE_PAUSE) && ((mode) != SENT_NOT_IGNORE_PAUSE))

/* check pulse polarity parameter */
#define NOT_SENT_PULSE_POLARITY(polarity)               (((polarity) != SENT_PULSE_POLARITY_HIGH) && ((polarity) != SENT_PULSE_POLARITY_LOW))

/* check fractional divider mode parameter */
#define NOT_SENT_CLOCK_DIVIDER_MODE(mode)               (((mode) != SENT_CLOCKDIVIDERMODE_OFF) && ((mode) != SENT_CLOCKDIVIDERMODE_NORMAL) && ((mode) != SENT_CLOCKDIVIDERMODE_FRACTIONAL))

/* check step value parameter */
#define SENT_CLOCK_STEP_HIGH_VALUE                      ((uint32_t)0x000003FFU)
#define NOT_SENT_CLOCK_STEP(stepvalue)                  (SENT_CLOCK_STEP_HIGH_VALUE < (stepvalue))

/* check frequency drift check parameter */
#define SENT_CHANNEL_TICK_LOW_VALUE                     ((double)0.00000004)
#define SENT_CHANNEL_TICK_HIGH_VALUE                    ((double)0.001024)
#define NOT_SENT_CHANNEL_TICK(tick_unit)                ((SENT_CHANNEL_TICK_LOW_VALUE > (tick_unit)) || (SENT_CHANNEL_TICK_HIGH_VALUE < (tick_unit)))

/* check digital filter timer threshold parameter */
#define SENT_CHANNEL_FILTER_TH_HIGH_VALUE               ((uint32_t)0x0000000FU)
#define NOT_SENT_CHANNEL_FILTER_TH(threshold)           (SENT_CHANNEL_FILTER_TH_HIGH_VALUE < (threshold))

/* check time stamp prescaler parameter */
#define SENT_TIMESTAMP_PRESCALER_HIGH_VALUE             ((uint32_t)0x000FFFFFU)
#define NOT_SENT_TIMESTAMP_PRESCALER(psc)               (SENT_TIMESTAMP_PRESCALER_HIGH_VALUE < (psc))

/* check interrupt parameter */
#define NOT_SENT_INTERRUPT(interrupt)                   (((interrupt) != SENT_INT_RSF)     && ((interrupt) != SENT_INT_RBNE) && \
                                                        ((interrupt) != SENT_INT_RXOVERR)  && ((interrupt) != SENT_INT_FDEVERR) && \
                                                        ((interrupt) != SENT_INT_FDERR)    && ((interrupt) != SENT_INT_NNIBERR) && \
                                                        ((interrupt) != SENT_INT_NIBVERR)  && ((interrupt) != SENT_INT_CRCERR) && \
                                                        ((interrupt) != SENT_INT_SSDSTERR) && ((interrupt) != SENT_INT_SDRBNE) && \
                                                        ((interrupt) != SENT_INT_SDCRCERR) && ((interrupt) != SENT_INT_WDERR))
 /* check interrupt flag parameter */
#define NOT_SENT_INT_FLAG(int_flag)                     (((int_flag) != SENT_INT_FLAG_RSF)     && ((int_flag) != SENT_INT_FLAG_RBNE) && \
                                                        ((int_flag) != SENT_INT_FLAG_RXOVERR)  && ((int_flag) != SENT_INT_FLAG_FDEVERR) && \
                                                        ((int_flag) != SENT_INT_FLAG_FDERR)    && ((int_flag) != SENT_INT_FLAG_NNIBERR) && \
                                                        ((int_flag) != SENT_INT_FLAG_NIBVERR)  && ((int_flag) != SENT_INT_FLAG_CRCERR) && \
                                                        ((int_flag) != SENT_INT_FLAG_SSDSTERR) && ((int_flag) != SENT_INT_FLAG_SDRBNE) && \
                                                        ((int_flag) != SENT_INT_FLAG_SDCRCERR) && ((int_flag) != SENT_INT_FLAG_WDERR))
                                              
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* initialization functions */
/* reset SENT */
void sent_deinit(void);
/* initialize the parameters of SENT structure with the default values */
void sent_struct_para_init(sent_parameter_struct *sent_struct);
/* initialize SENT parameters */
void sent_init(sent_channel_enum channelx, sent_parameter_struct *sent_struct);
/* enable SENT */
void sent_enable(void);
/* disable SENT */
void sent_disable(void);
/* enable SENT sleep mode */
void sent_sleep_enable(void);
/* disable SENT sleep mode */
void sent_sleep_disable(void);

/* application function declarations */
/* get SENT state */
ControlStatus sent_state_get(void);
/* enable SENT channel x */
void sent_channel_enable(sent_channel_enum channelx);
/* disable SENT channel x */
void sent_channel_disable(sent_channel_enum channelx);
/* get SENT channel x state */
uint32_t sent_channel_state_get(sent_channel_enum channelx);
/* select SENT channel x input */
void sent_channel_input_select(sent_channel_enum channelx, sent_channel_input_enum inputx);
/* configure SENT module clock */
void sent_module_clock_config(uint32_t dividermode, uint32_t stepvalue);
/* configure SENT ticks clock */
void sent_channel_tick_clock_config(sent_channel_enum channelx, double tick_unit);
/* set SENT filter threshold */
void sent_filter_threshold_set(sent_channel_enum channelx, uint32_t threshold);
/* configure SENT channel data nibble storage position */
void sent_data_nibble_pos_config(sent_channel_enum channelx, sent_nibble_control_struct *data);
/* configure SENT timestamp prescaler */
void sent_timestamp_prescaler_config(uint32_t psc);
/* get SENT current timestamp */
uint32_t sent_timestamp_get(void);
/* set SENT watchdog threshold */
void sent_watchdog_threshold_set(sent_channel_enum channelx, uint16_t threshold);
/* SENT receive data nibble */
uint32_t sent_receive_data(sent_channel_enum channelx);
/* SENT receive frame */
void sent_receive_frame(sent_channel_enum channelx, sent_frame_struct *frame);
/* SENT receive serial message */
void sent_receive_serial_message(sent_channel_enum channelx, sent_serialmessage_frame_struct *message);
/* get the falling edge count occurring on the selected SENT input pin */
uint8_t sent_input_edge_count_get(sent_channel_enum channelx);
/* clear the falling edge count occurring on the selected SENT input pin */
void sent_input_edge_count_clear(sent_channel_enum channelx);
/* get SENT frame length */
double sent_get_frame_length(sent_channel_enum channelx);
/* get SENT synchronization pulse length */
double sent_get_sync_length(sent_channel_enum channelx);

/* interrupt & flag functions */
/* set SENT channel flag status */
void sent_channel_flag_set(sent_channel_enum channelx, sent_channel_flag_enum flag);
/* get SENT channel flag */
FlagStatus sent_channel_flag_get(sent_channel_enum channelx, sent_channel_flag_enum flag);
/* clear SENT channel status */
void sent_channel_flag_clear(sent_channel_enum channelx, sent_channel_flag_clear_enum flag);
/* enable SENT channel interrupt */
void sent_channel_interrupt_enable(sent_channel_enum channelx, uint32_t interrupt);
/* disable SENT channel interrupt */
void sent_channel_interrupt_disable(sent_channel_enum channelx, uint32_t interrupt);
/* get SENT channel interrupt and flag status */
FlagStatus sent_channel_interrupt_flag_get(sent_channel_enum channelx, uint32_t int_flag);
/* get SENT channel global interrupt and flag status */
FlagStatus sent_channel_global_interrupt_flag_get(sent_channel_enum channelx);
/* clear SENT  channel interrupt flag */
void sent_channel_interrupt_flag_clear(sent_channel_enum channelx, uint32_t int_flag);

#endif /* GD32A7XX_SENT_H */ 
